-- phpMyAdmin SQL Dump
-- version 5.0.4
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Aug 10, 2021 at 10:34 AM
-- Server version: 5.7.24
-- PHP Version: 7.4.15

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `algeria`
--

-- --------------------------------------------------------

--
-- Table structure for table `wilayas`
--

CREATE TABLE `wilayas` (
  `id` int(10) UNSIGNED NOT NULL,
  `code` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `postcode` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name_ar` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `name_en` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `name_ber` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `latitude` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `longitude` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `wilayas`
--

INSERT INTO `wilayas` (`id`, `code`, `postcode`, `name_ar`, `name_en`, `name_ber`, `latitude`, `longitude`) VALUES
(1, '1', '01001', 'أدرار', 'Adrar', 'ⴰⴷⵕⴰⵕ', '27.9458867', '-0.199293833025847'),
(2, '2', '02001', ' الشلف', 'Chlef', 'ⵛⵍⴻⴼ', '36.164592', '1.331499'),
(3, '3', '03001', 'الأغواط', 'Laghouat', 'ⵍⴰⴴⵡⴰⵟ', '33.8063518', '2.8808616'),
(4, '4', '04001', 'أم البواقي', 'Oum El Bouaghi', 'ⵓⵎ ⵍⴻⴱⵡⴰⵇⵉ', '35.8374839', '7.15654848292084'),
(5, '5', '05001', 'باتنة', 'Batna', 'ⵜⴱⴰⵜⴻⵏⵜ', '35.554404', '6.1767453'),
(6, '6', '06001', ' بجاية', 'Bejaia', 'ⴲⴳⴰⵢⴻⵝ', '36.7511783', '5.0643687'),
(7, '7', '07001', 'بسكرة', 'Biskra', 'ⵜⵉⴱⴻⵙⴽⴻⵔⵜ', '34.8508508', '5.7286878'),
(8, '8', '08001', 'بشار', 'Bechar', 'ⴱⴻⵛⵛⴰⵔ', '31.6165355', '-2.2180053'),
(9, '9', '09001', 'البليدة', 'Blida', 'ⵍⴻⴱⵍⵉⴸⴰ', '36.4701645', '2.8287985'),
(10, '10', '10001', 'البويرة', 'Bouira', 'ⵜⵓⴱⵉⵔⴻⵜ', '36.3739012', '3.9007007'),
(11, '11', '11001', 'تمنراست', 'Tamanrasset', 'ⵜⴰⵎⴻⵏⵔⴰⵙⴻⵜ', '22.2701245', '5.80956836297059'),
(12, '12', '12001', 'تبسة', 'Tebessa', 'ⵜⴱⴻⵙⵙⴰ', '35.4035956', '8.1212322'),
(13, '13', '13001', 'تلمسان', 'Tlemcen', 'ⵜⴰⵍⴰ ⵉⵎⵙⴰⵏ', '34.881789', '-1.316699'),
(14, '14', '14001', 'تيارت', 'Tiaret', 'ⵜⴰⵀⴻⵔⵜ', '35.3661448', '1.3194687'),
(15, '15', '15001', 'تيزي وزو', 'Tizi Ouzou', 'ⵝⵉⵣⵉ ⵡⴻⵣⵓ', '36.7137843', '4.0493919'),
(16, '16', '16001', 'الجزائر', 'Alger Centre', 'ⴷⵣⴰⵢⴻⵔ ⵜⴰⵍⴻⵎⵎⴰⵙⵜ', '36.7763022', '3.0584856'),
(17, '17', '17001', 'الجلفة', 'Djelfa', 'ⴵⴻⵍⴼⴰ', '34.671359', '3.254037'),
(18, '18', '18001', 'جيجل', 'Jijel', 'ⵉⵖⵉⵍ ⴳⵉⵍⵉ', '36.8167305', '5.771494'),
(19, '19', '19001', 'سطيف', 'Setif', 'ⵚⵟⵉⴼ', '36.1892751', '5.403493'),
(20, '20', '20001', 'سعيدة', 'Saida', 'ⵙⵄⵉⴷⴰ', '34.8416405', '0.1509912'),
(21, '21', '21001', 'سكيكدة', 'Skikda', 'ⵙⴽⵉⴽⴷⴰ', '36.879882', '6.907485'),
(22, '22', '22001', 'سيدي بلعباس', 'Sidi Bel Abbès', 'ⵙⵉⴷⵉ ⴱⵍⵄⴰⴱⴰⵙ', '35.1911682', '-0.6347284'),
(23, '23', '23001', 'عنابة', 'Annaba', 'ⵄⴻⵍⵍⴰⴱⴰ', '36.8982165', '7.7549272'),
(24, '24', '24001', 'قالمة', 'Guelma', 'ⴳⴰⵍⵎⴰ', '36.465084', '7.430647'),
(25, '25', '25001', 'قسنطينة', 'Constantine', 'ⵇⵙⴻⵟⵉⵏⴰ', '36.364519', '6.60826'),
(26, '26', '26001', 'المدية', 'Medea', 'ⵍⴻⵎⴷⵉⵢⴰ', '36.265344', '2.766957'),
(27, '27', '27001', 'مستغانم', 'Mostaganem', 'ⵎⴻⵙⵜⵖⴰⵏⴻⵎ', '35.928808', '0.089978'),
(28, '28', '28001', 'المسيلة', 'Msila', 'ⵝⴰⵎⵙⵉⵍⵜ', '35.7087553', '4.5371552'),
(29, '29', '29001', 'معسكر', 'Mascara', 'ⵎⵄⴰⵙⴽⴰⵕ', '35.394081', '0.1379568'),
(30, '30', '30001', 'ورقلة', 'Ouargla', 'ⵡⴰⵔⴳⵍⴰ', '31.94467', '5.320958'),
(31, '31', '31001', 'وهران', 'Oran', '', '35.7032751', '-0.6492976'),
(32, '32', '32001', 'البيض', 'El Bayadh', 'ⵍⴱⴻⵢⴻⴹ', '33.63785225', '1.01220391125046'),
(33, '33', '33001', 'إليزي', 'Illizi', 'ⵉⵍⵉⵣⵉ', '26.4880835', '8.35714915067357'),
(34, '34', '34001', 'برج بوعريريج', 'Bordj Bou Arreridj', 'ⴱⵓⴵ ⴱⵓ ⴰⵄⵔⵉⵔⵉⴵ', '36.0676413', '4.74526399967757'),
(35, '35', '35001', 'بومرداس', 'Boumerdès', 'ⴱⵓⵎⴻⵔⴷⴰⵙ', '36.7560385', '3.47874068259011'),
(36, '36', '36001', 'الطارف', 'El Tarf', 'ⵟⵟⴰⵔⴻⴼ', '36.754211', '8.31347507815534'),
(37, '37', '37001', 'تندوف', 'Tindouf', 'ⵜⵉⵏⴷⵓⴼ', '27.2231241', '-7.08630466073867'),
(38, '38', '38001', 'تيسمسيلت', 'Tissemsilt', 'ⵝⵉⵙⴻⵎⵙⵉⵍⵜ', '35.604813', '1.810476'),
(39, '39', '39001', 'الوادي', 'El Oued', 'ⵍⵡⴰⴷ / ⴰⵙⵉⴼ', '33.3536537', '6.8639906377931'),
(40, '40', '40001', 'خنشلة', 'Khenchela', 'ⵅⴻⵏⵛⴻⵍⵜ', '35.430154', '7.145711'),
(41, '41', '41001', 'سوق أهراس', 'Souk Ahras', 'ⵜⴰⴳⴰⵙⵜ', '36.284832', '7.9515466'),
(42, '42', '42001', 'تيبازة', 'Tipaza', 'ⵜⵉⵒⴰⵣⴰ', '36.59689825', '2.39693641544915'),
(43, '43', '43001', 'ميلة', 'Mila', 'ⵎⵉⵍⴰ', '36.451941', '6.262331'),
(44, '44', '44001', 'عين الدفلة', 'Ain Defla', 'ⵄⵉⵏ ⴷⴻⴼⵍⴰ', '36.2656797', '1.9701666'),
(45, '45', '45001', 'النعامة', 'Naama', 'ⵏⴰⴰⵎⴰ', '33.2840315', '-0.294821703221287'),
(46, '46', '46001', 'عين تيموشنت', 'Ain Temouchent', 'ⵄⵉⵏ ⵜⵉⵎⵓⵛⴻⵏⵜ', '35.26665705', '-1.1499276224075'),
(47, '47', '47001', 'غرداية', 'Ghardaia', 'ⵜⴰⵖⴻⵔⴷⴰⵢⵜ', '32.485855', '3.677104'),
(48, '48', '48001', 'غليزان', 'Relizane', 'Iⴳⵀⵉⵍ Iⵣⴰⵏ', '35.7381193', '0.5547673'),
(49, '49', '01009', 'تيميمون', 'Timimoun', 'ⵜⵉⵎⵉⵎⵓⵏ', '29.6911885', '1.55544571795234'),
(50, '50', '01025', 'برج باجي مختار', 'Bordj Badji Mokhtar', 'ⴱⵓⵔⴵ ⴱⴰⴵⵉ ⵎⵓⵅⵜⴰⵔ', '22.97994035', '-0.144905165624854'),
(51, '51', '07005', 'أولاد جلال', 'Ouled Djellal', 'ⵡⵍⴻⴷ ⴵⴻⵍⴰⵍ', '34.4254103', '5.0644342'),
(52, '52', '08007', 'بني عباس', 'Beni Abbes', 'ⴰⵢⵜ ⴰⴱⴱⴰⵙ', '30.1317426', '-2.169031'),
(53, '53', '11008', 'عين صالح', 'In Salah', 'ⵄⵉⵏ ⵙⴰⵍⴻⵃ', '27.2188905', '2.46835239474902'),
(54, '54', '11004', 'عين قزام', 'In Guezzam', 'ⵄⵉⵏ ⴳⴻⵣⵣⴰⵎ', '20.390479', '5.48311205730573'),
(55, '55', '30013', 'تقرت', 'Touggourt', 'ⵜⵓⴳⵓⵔⵜ', '33.1098968', '6.066102'),
(56, '56', '33002', 'جانت', 'Djanet', 'ⴵⴰⵏⴻⵜ', '23.9027645', '10.1301801171869'),
(57, '57', '39027', 'المغير', 'El Mghair', 'ⵍⴻⵎⵖⵉⵔ', '33.9496809', '5.921089'),
(58, '58', '47002', 'المنيعة', 'El Menia', 'ⵍⴻⵎⵏⵉⵄⴰ', '31.36370625', '2.90964575455801');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `wilayas`
--
ALTER TABLE `wilayas`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `wilayas`
--
ALTER TABLE `wilayas`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=59;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
