-- Adminer 4.8.1 MySQL 5.7.24 dump

SET NAMES utf8;
SET time_zone = '+00:00';
SET foreign_key_checks = 0;
SET sql_mode = 'NO_AUTO_VALUE_ON_ZERO';

SET NAMES utf8mb4;

DROP TABLE IF EXISTS `wilayas`;
CREATE TABLE `wilayas` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `code` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `postcode` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name_ar` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `name_ar_2` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `name_en` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `name_ber` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `latitude` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `longitude` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

INSERT INTO `wilayas` (`id`, `code`, `postcode`, `name`, `name_ar`, `name_ar_2`, `name_en`, `name_ber`, `latitude`, `longitude`) VALUES
(1,	'1',	'01001',	'ADRAR',	'أدرار',	'أدرار',	'Adrar',	'ⴰⴷⵕⴰⵕ',	'27.9458867',	'-0.199293833025847'),
(2,	'2',	'02001',	'CHLEF',	' الشلف',	'الشلف',	'Chlef',	'ⵛⵍⴻⴼ',	'36.164592',	'1.331499'),
(3,	'3',	'03001',	'LAGHOUAT',	'الأغواط',	'الأغواط',	'Laghouat',	'ⵍⴰⴴⵡⴰⵟ',	'33.8063518',	'2.8808616'),
(4,	'4',	'04001',	'OUM EL BOUAGHI',	'أم البواقي',	'أم البواقي',	'Oum El Bouaghi',	'ⵓⵎ ⵍⴻⴱⵡⴰⵇⵉ',	'35.8374839',	'7.15654848292084'),
(5,	'5',	'05001',	'BATNA',	'باتنة',	'باتنة',	'Batna',	'ⵜⴱⴰⵜⴻⵏⵜ',	'35.554404',	'6.1767453'),
(6,	'6',	'06001',	'BÉJAÏA',	' بجاية',	'بجاية',	'Bejaia',	'ⴲⴳⴰⵢⴻⵝ',	'36.7511783',	'5.0643687'),
(7,	'7',	'07001',	'BISKRA',	'بسكرة',	'بسكرة',	'Biskra',	'ⵜⵉⴱⴻⵙⴽⴻⵔⵜ',	'34.8508508',	'5.7286878'),
(8,	'8',	'08001',	'BÉCHAR',	'بشار',	'بشار',	'Bechar',	'ⴱⴻⵛⵛⴰⵔ',	'31.6165355',	'-2.2180053'),
(9,	'9',	'09001',	'BLIDA',	'البليدة',	'البليدة',	'Blida',	'ⵍⴻⴱⵍⵉⴸⴰ',	'36.4701645',	'2.8287985'),
(10,	'10',	'10001',	'BOUIRA',	'البويرة',	'البويرة',	'Bouira',	'ⵜⵓⴱⵉⵔⴻⵜ',	'36.3739012',	'3.9007007'),
(11,	'11',	'11001',	'TAMANRASSET',	'تمنراست',	'تامنغست',	'Tamanrasset',	'ⵜⴰⵎⴻⵏⵔⴰⵙⴻⵜ',	'22.2701245',	'5.80956836297059'),
(12,	'12',	'12001',	'TÉBESSA',	'تبسة',	'تبسة',	'Tebessa',	'ⵜⴱⴻⵙⵙⴰ',	'35.4035956',	'8.1212322'),
(13,	'13',	'13001',	'TLEMCEN',	'تلمسان',	'تلمسان',	'Tlemcen',	'ⵜⴰⵍⴰ ⵉⵎⵙⴰⵏ',	'34.881789',	'-1.316699'),
(14,	'14',	'14001',	'TIARET',	'تيارت',	'تيارت‎',	'Tiaret',	'ⵜⴰⵀⴻⵔⵜ',	'35.3661448',	'1.3194687'),
(15,	'15',	'15001',	'TIZI OUZOU',	'تيزي وزو',	'تيزي وزو',	'Tizi Ouzou',	'ⵝⵉⵣⵉ ⵡⴻⵣⵓ',	'36.7137843',	'4.0493919'),
(16,	'16',	'16001',	'ALGER',	'الجزائر',	'الجزائر الوسطى',	'Alger Centre',	'ⴷⵣⴰⵢⴻⵔ ⵜⴰⵍⴻⵎⵎⴰⵙⵜ',	'36.7763022',	'3.0584856'),
(17,	'17',	'17001',	'DJELFA',	'الجلفة',	'الجلفة',	'Djelfa',	'ⴵⴻⵍⴼⴰ',	'34.671359',	'3.254037'),
(18,	'18',	'18001',	'JIJEL',	'جيجل',	'جيجل',	'Jijel',	'ⵉⵖⵉⵍ ⴳⵉⵍⵉ',	'36.8167305',	'5.771494'),
(19,	'19',	'19001',	'SÉTIF',	'سطيف',	'سطيف‎',	'Setif',	'ⵚⵟⵉⴼ',	'36.1892751',	'5.403493'),
(20,	'20',	'20001',	'SAÏDA',	'سعيدة',	'سعيدة',	'Saida',	'ⵙⵄⵉⴷⴰ',	'34.8416405',	'0.1509912'),
(21,	'21',	'21001',	'SKIKDA',	'سكيكدة',	'سكيكدة',	'Skikda',	'ⵙⴽⵉⴽⴷⴰ',	'36.879882',	'6.907485'),
(22,	'22',	'22001',	'SIDI BEL ABBÈS',	'سيدي بلعباس',	'سيدي بلعباس',	'Sidi Bel Abbès',	'ⵙⵉⴷⵉ ⴱⵍⵄⴰⴱⴰⵙ',	'35.1911682',	'-0.6347284'),
(23,	'23',	'23001',	'ANNABA',	'عنابة',	'عنابة‎',	'Annaba',	'ⵄⴻⵍⵍⴰⴱⴰ',	'36.8982165',	'7.7549272'),
(24,	'24',	'24001',	'GUELMA',	'قالمة',	'قالمة',	'Guelma',	'ⴳⴰⵍⵎⴰ',	'36.465084',	'7.430647'),
(25,	'25',	'25001',	'CONSTANTINE',	'قسنطينة',	'قسنطينة',	'Constantine',	'ⵇⵙⴻⵟⵉⵏⴰ',	'36.364519',	'6.60826'),
(26,	'26',	'26001',	'MÉDÉA',	'المدية',	'المدية',	'Medea',	'ⵍⴻⵎⴷⵉⵢⴰ',	'36.265344',	'2.766957'),
(27,	'27',	'27001',	'MOSTAGANEM',	'مستغانم',	'مستغانم',	'Mostaganem',	'ⵎⴻⵙⵜⵖⴰⵏⴻⵎ',	'35.928808',	'0.089978'),
(28,	'28',	'28001',	'M\'SILA',	'المسيلة',	'المسيلة',	'Msila',	'ⵝⴰⵎⵙⵉⵍⵜ',	'35.7087553',	'4.5371552'),
(29,	'29',	'29001',	'MASCARA',	'معسكر',	'معسكر',	'Mascara',	'ⵎⵄⴰⵙⴽⴰⵕ',	'35.394081',	'0.1379568'),
(30,	'30',	'30001',	'OUARGLA',	'ورقلة',	'ورقلة',	'Ouargla',	'ⵡⴰⵔⴳⵍⴰ',	'31.94467',	'5.320958'),
(31,	'31',	'31001',	'ORAN',	'وهران',	'وهران',	'Oran',	'',	'35.7032751',	'-0.6492976'),
(32,	'32',	'32001',	'EL BAYADH',	'البيض',	'البيض',	'El Bayadh',	'ⵍⴱⴻⵢⴻⴹ',	'33.63785225',	'1.01220391125046'),
(33,	'33',	'33001',	'ILLIZI',	'إليزي',	'إليزي',	'Illizi',	'ⵉⵍⵉⵣⵉ',	'26.4880835',	'8.35714915067357'),
(34,	'34',	'34001',	'BORDJ BOU ARRERIDJ',	'برج بوعريريج',	'برج بوعريريج',	'Bordj Bou Arreridj',	'ⴱⵓⴵ ⴱⵓ ⴰⵄⵔⵉⵔⵉⴵ',	'36.0676413',	'4.74526399967757'),
(35,	'35',	'35001',	'BOUMERDÈS',	'بومرداس',	'بومرداس',	'Boumerdès',	'ⴱⵓⵎⴻⵔⴷⴰⵙ',	'36.7560385',	'3.47874068259011'),
(36,	'36',	'36001',	'EL TARF',	'الطارف',	'الطارف',	'El Tarf',	'ⵟⵟⴰⵔⴻⴼ',	'36.754211',	'8.31347507815534'),
(37,	'37',	'37001',	'TINDOUF',	'تندوف',	'تندوف',	'Tindouf',	'ⵜⵉⵏⴷⵓⴼ',	'27.2231241',	'-7.08630466073867'),
(38,	'38',	'38001',	'TISSEMSILT',	'تيسمسيلت',	'تسمسيلت',	'Tissemsilt',	'ⵝⵉⵙⴻⵎⵙⵉⵍⵜ',	'35.604813',	'1.810476'),
(39,	'39',	'39001',	'EL OUED',	'الوادي',	'الوادي',	'El Oued',	'ⵍⵡⴰⴷ / ⴰⵙⵉⴼ',	'33.3536537',	'6.8639906377931'),
(40,	'40',	'40001',	'KHENCHELA',	'خنشلة',	'خنشلة',	'Khenchela',	'ⵅⴻⵏⵛⴻⵍⵜ',	'35.430154',	'7.145711'),
(41,	'41',	'41001',	'SOUK AHRAS',	'سوق أهراس',	'سوق أهراس',	'Souk Ahras',	'ⵜⴰⴳⴰⵙⵜ',	'36.284832',	'7.9515466'),
(42,	'42',	'42001',	'TIPAZA',	'تيبازة',	'تيبازة',	'Tipaza',	'ⵜⵉⵒⴰⵣⴰ',	'36.59689825',	'2.39693641544915'),
(43,	'43',	'43001',	'MILA',	'ميلة',	'ميلة',	'Mila',	'ⵎⵉⵍⴰ',	'36.451941',	'6.262331'),
(44,	'44',	'44001',	'AÏN DEFLA',	'عين الدفلة',	'عين الدفلى',	'Ain Defla',	'ⵄⵉⵏ ⴷⴻⴼⵍⴰ',	'36.2656797',	'1.9701666'),
(45,	'45',	'45001',	'NAÂMA',	'النعامة',	'النــعـامـة',	'Naama',	'ⵏⴰⴰⵎⴰ',	'33.2840315',	'-0.294821703221287'),
(46,	'46',	'46001',	'AÏN TÉMOUCHENT',	'عين تيموشنت',	'عين تموشنت',	'Ain Temouchent',	'ⵄⵉⵏ ⵜⵉⵎⵓⵛⴻⵏⵜ',	'35.26665705',	'-1.1499276224075'),
(47,	'47',	'47001',	'GHARDAÏA',	'غرداية',	'غرداية',	'Ghardaia',	'ⵜⴰⵖⴻⵔⴷⴰⵢⵜ',	'32.485855',	'3.677104'),
(48,	'48',	'48001',	'RELIZANE',	'غليزان',	'غليزان',	'Relizane',	'Iⴳⵀⵉⵍ Iⵣⴰⵏ',	'35.7381193',	'0.5547673'),
(49,	'49',	'01009',	'TIMIMOUNE',	'تيميمون',	'ﺗﻴﻤﻴﻤﻮن‎',	'Timimoun',	'ⵜⵉⵎⵉⵎⵓⵏ',	'29.6911885',	'1.55544571795234'),
(50,	'50',	'01025',	'BORDJ BADJI MOKHTAR',	'برج باجي مختار',	'برجي باجي مختار',	'Bordj Badji Mokhtar',	'ⴱⵓⵔⴵ ⴱⴰⴵⵉ ⵎⵓⵅⵜⴰⵔ',	'22.97994035',	'-0.144905165624854'),
(51,	'51',	'07005',	'OULED DJELLAL',	'أولاد جلال',	'اولاد جلال',	'Ouled Djellal',	'ⵡⵍⴻⴷ ⴵⴻⵍⴰⵍ',	'34.4254103',	'5.0644342'),
(52,	'52',	'08007',	'BENI ABBES',	'بني عباس',	'بني عباس',	'Beni Abbes',	'ⴰⵢⵜ ⴰⴱⴱⴰⵙ',	'30.1317426',	'-2.169031'),
(53,	'53',	'11008',	'IN SALAH',	'عين صالح',	'عين صالح',	'In Salah',	'ⵄⵉⵏ ⵙⴰⵍⴻⵃ',	'27.2188905',	'2.46835239474902'),
(54,	'54',	'11004',	'IN GUEZZAM',	'عين قزام',	'عين قزام',	'In Guezzam',	'ⵄⵉⵏ ⴳⴻⵣⵣⴰⵎ',	'20.390479',	'5.48311205730573'),
(55,	'55',	'30013',	'TOUGGOURT',	'تقرت',	'تقرت',	'Touggourt',	'ⵜⵓⴳⵓⵔⵜ',	'33.1098968',	'6.066102'),
(56,	'56',	'33002',	'DJANET',	'جانت',	'جانت',	'Djanet',	'ⴵⴰⵏⴻⵜ',	'23.9027645',	'10.1301801171869'),
(57,	'57',	'39027',	'EL M\'GHAIR',	'المغير',	'المغير',	'El Mghair',	'ⵍⴻⵎⵖⵉⵔ',	'33.9496809',	'5.921089'),
(58,	'58',	'47002',	'EL MENIA',	'المنيعة',	'المنيعة',	'El Menia',	'ⵍⴻⵎⵏⵉⵄⴰ',	'31.36370625',	'2.90964575455801');

-- 2021-08-03 17:39:52
